; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	spectrograph3 - mode
	infrared4 - mode
	infrared1 - mode
	spectrograph8 - mode
	thermograph0 - mode
	spectrograph9 - mode
	thermograph2 - mode
	thermograph5 - mode
	spectrograph6 - mode
	infrared7 - mode
	Star0 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	Star3 - direction
	Star1 - direction
	Planet5 - direction
	Planet6 - direction
	Star7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
)
(:init
	(supports instrument0 spectrograph8)
	(supports instrument0 spectrograph9)
	(calibration_target instrument0 Star3)
	(supports instrument1 spectrograph3)
	(supports instrument1 infrared1)
	(supports instrument1 infrared7)
	(supports instrument1 thermograph5)
	(calibration_target instrument1 Star1)
	(supports instrument2 spectrograph3)
	(supports instrument2 spectrograph6)
	(supports instrument2 thermograph2)
	(supports instrument2 thermograph0)
	(supports instrument2 infrared4)
	(calibration_target instrument2 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet6)
)
(:goal (and
	(pointing satellite0 Planet5)
	(have_image Planet5 spectrograph3)
	(have_image Planet6 infrared4)
	(have_image Planet6 thermograph0)
	(have_image Planet6 thermograph5)
	(have_image Star7 thermograph5)
	(have_image Star7 infrared1)
	(have_image Star7 thermograph2)
	(have_image Planet8 infrared7)
	(have_image Planet8 spectrograph6)
	(have_image Phenomenon9 infrared1)
	(have_image Phenomenon10 infrared1)
	(have_image Phenomenon11 thermograph5)
	(have_image Phenomenon11 spectrograph3)
))

)

; plan
1. (turn_to satellite0 star1 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star1)
   goals met: 0 of 14
2. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 14
3. (calibrate satellite0 instrument2 star1)
   added: (calibrated instrument2)
   goals met: 0 of 14
4. (turn_to satellite0 star7 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star7)
   goals met: 0 of 14
5. (take_image satellite0 star7 instrument2 thermograph2)
   added: (have_image star7 thermograph2)
   goals met: 1 of 14
6. (turn_to satellite0 planet8 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 planet8)
   goals met: 1 of 14
7. (take_image satellite0 planet8 instrument2 spectrograph6)
   added: (have_image planet8 spectrograph6)
   goals met: 2 of 14
8. (turn_to satellite0 planet6 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet6)
   goals met: 2 of 14
9. (take_image satellite0 planet6 instrument2 thermograph0)
   added: (have_image planet6 thermograph0)
   goals met: 3 of 14
10. (take_image satellite0 planet6 instrument2 infrared4)
   added: (have_image planet6 infrared4)
   goals met: 4 of 14
11. (turn_to satellite0 star1 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star1)
   goals met: 4 of 14
12. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 4 of 14
13. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 4 of 14
14. (calibrate satellite0 instrument1 star1)
   added: (calibrated instrument1)
   goals met: 4 of 14
15. (turn_to satellite0 phenomenon10 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon10)
   goals met: 4 of 14
16. (take_image satellite0 phenomenon10 instrument1 infrared1)
   added: (have_image phenomenon10 infrared1)
   goals met: 5 of 14
17. (turn_to satellite0 phenomenon11 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon11)
   goals met: 5 of 14
18. (take_image satellite0 phenomenon11 instrument1 spectrograph3)
   added: (have_image phenomenon11 spectrograph3)
   goals met: 6 of 14
19. (take_image satellite0 phenomenon11 instrument1 thermograph5)
   added: (have_image phenomenon11 thermograph5)
   goals met: 7 of 14
20. (turn_to satellite0 phenomenon9 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon9)
   goals met: 7 of 14
21. (take_image satellite0 phenomenon9 instrument1 infrared1)
   added: (have_image phenomenon9 infrared1)
   goals met: 8 of 14
22. (turn_to satellite0 planet6 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet6)
   goals met: 8 of 14
23. (take_image satellite0 planet6 instrument1 thermograph5)
   added: (have_image planet6 thermograph5)
   goals met: 9 of 14
24. (turn_to satellite0 planet8 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 planet8)
   goals met: 9 of 14
25. (take_image satellite0 planet8 instrument1 infrared7)
   added: (have_image planet8 infrared7)
   goals met: 10 of 14
26. (turn_to satellite0 star7 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star7)
   goals met: 10 of 14
27. (take_image satellite0 star7 instrument1 infrared1)
   added: (have_image star7 infrared1)
   goals met: 11 of 14
28. (take_image satellite0 star7 instrument1 thermograph5)
   added: (have_image star7 thermograph5)
   goals met: 12 of 14
29. (turn_to satellite0 planet5 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 planet5)
   goals met: 13 of 14
30. (take_image satellite0 planet5 instrument1 spectrograph3)
   added: (have_image planet5 spectrograph3)
   goals met: 14 of 14
